# Божидара разполага с няколко къщи на Черноморието и желае да озелени дворовете на някои от тях,
# като по този начин създаде уютна обстановка и комфорт на гостите си. За целта е наела фирма.
# Напишете програма, която изчислява необходимате сума, които Божидара ще трябва да заплати на фирмата
# изпълнител на проекта. Цената на един кв. м. е 7.61 лв със ДДС. Понеже нейният двор е доста голям,
# фирмата изпълнител предлага 18% отстъпка от крайната цена.

area = float(input())
price_per_square_meter = 7.61

total_price = area * price_per_square_meter
discount = 18 / 100 * total_price

final_price = total_price - discount

print(f"The final price is: {final_price} lv.")
print(f"The discount is: {discount} lv.")



