# Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
# Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).

# · Ако числото е до 100 включително, бонус точките са 5;
# · Ако числото е по-голямо от 100, бонус точките са 20% от числото;
# · Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
# · Допълнителни бонус точки (начисляват се отделно от предходните):
# o За четно число à + 1 т.
# o За число, което завършва на 5 à + 2
start_number = [0]
start_number[0] = int(input())
bonus = 0
additional_bonus = 0
if start_number[0] <= 100:
    bonus = 5
elif start_number[0] <= 1000:
    bonus = (20 * start_number[0]) / 100
else:
    bonus = (10 * start_number[0]) / 100
if start_number[0] % 2 == 0:
    bonus += 1
if start_number[0] % 10 == 5:
    bonus += 2
final_number = start_number[0] + bonus + additional_bonus
print(bonus)
print(final_number)




