# Задача 4. Компютърна фирма
# Фирма за компютри е наела Вас, за да изчислите възможните продажби. Да се напише програма, която за определен вид
# компютри пресмята средния рейтинг и направените ъвежда епродажби. Първо се вдно число от конзолата, което представлява
# броя на моделите компютри. След това последователно за всеки от моделите компютри се въвежда по едно число:
# Последната цифра (единиците) на това число представлява рейтингът, който е в интервала [2…6].
# Останалите цифри (стотици и десетици) са възможните продажби, които ще се осъществят.
# Компютърната продажба се скалира на база рейтинг:
# Рейтинг 2 взима 0% от  възможните продажби.
# Рейтинг 3 взима 50% от възможните продажби.
# Рейтинг 4 взима 70% от възможните продажби.
# Рейтинг 5 взима 85% от възможните продажби.
# Рейтинг 6 взима 100% от възможните продажби.
# Вход
# От конзолата се прочита:
# На първия ред:
# n - брой компютри - цяло число в интервала [1…10]
# На следващите n реда:
# Числото, представляващо възможните продажби и рейтинга - цяло число в интервала [32…306]
# Изход
# На конзолата се отпечатват 2 редa:
# Броят направени продажби
# Средноаритметичният рейтинг за всички компютри
# Продажбите и рейтингът трябва да са форматирани до втората цифра след десетичната запетая.

n = int(input())
total_sales = 0
total_rating = 0

for _ in range(n):
    num = int(input())
    rating = num % 10
    sales_potential = num // 10

    if rating == 2:
        sales = sales_potential * 0
    elif rating == 3:
        sales = sales_potential * 0.5
    elif rating == 4:
        sales = sales_potential * 0.7
    elif rating == 5:
        sales = sales_potential * 0.85
    elif rating == 6:
        sales = sales_potential * 1
        total_sales += sales
    total_rating += rating

average_rating = total_rating / n

print(f"{total_sales:.2f}")
print(f"{average_rating:.2f}")













